Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: ཤིན་ཏུ་མཐོང་བ་དང་། མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱི་བརྟུལ་ཞུགས་དང་། མཚུངས་པར་སྐྱེ་བར་འདོད་པ་དེས་ཀྱང་འདི་བཞིན་དུ་ལས་ཀྱི་སྒྲིབ་པ་རྣམས་སོ་སོར་བཤགས་པར་བྱའོ། །མི་བཅབ་པར་བྱའོ། །ཕྱིན་ཅད་ཀྱང་མི་བྱའོ། །སུ་གཟུགས་མེད་པ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དུ་ཉེ་བར་འགྲོ་བ་རྣམས་དང་།
en: “In the same way, those who wish to be reborn into the same way of life as that of the devas of Yāma, Tuṣita, Nirmāṇarati, Paranirmita­vaśavartin, Brahmakāyika, Brahmapurohita, Brahma­pariṣadya,Mahābrahmā, Parīttābha, Apramāṇābha, Ābhāsvara, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Anabhraka, Puṇyaprasava, Bṛhatphala, Asaṃjñasattva, Sudṛśa, Sudarśana, Avṛha, Atapa, or Akaniṣṭha should in this way confess their individual karmic obscurations, not conceal them, and state that they will not repeat them.

source: རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དུ་ཉེ་བར་འགྲོ་བ་རྣམས་དང་། ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་དུ་ཉེ་བར་འགྲོ་བ་རྣམས་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་དུ་ཉེ་བར་འགྲོ་བའི་ལྷ་རྣམས་ཀྱི་བརྟུལ་ཞུགས་དང་། མཚུངས་པར་སྐྱེ་བར་འདོད་པ་དེས་ཀྱང་འདི་བཞིན་དུ་ལས་ཀྱི་སྒྲིབ་པ་རྣམས་སོ་སོར་བཤགས་པར་བྱའོ། །མི་བཅབ་པར་བྱའོ། །ཕྱིན་ཅད་ཀྱང་མི་བྱའོ། །སུ་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་།
en: “Those who wish to be reborn among the devas who have arrived in the state of infinite space, the state of infinite consciousness, the state of nothingness, or the state of neither perception nor nonperception, with their condition of life, should in this way confess their individual karmic obscurations, not conceal them, and state that they will not repeat them.

source: ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་འདོད་པ་དེས་ཀྱང་། འདི་བཞིན་དུ་ལས་ཀྱི་སྒྲིབ་པ་རྣམས་སོ་སོར་བཤགས་པར་བྱའོ། །མི་བཅབ་པར་བྱའོ། །ཕྱིན་ཅད་ཀྱང་མི་བྱའོ། །
en: “Those who wish to reach the result of a stream entrant, the result of a once-returner, the result of a non-returner, or to manifest arhathood should in this way confess their individual karmic obscurations, not conceal them, and state that they will not repeat them.

source: སུ་རིག་པ་གསུམ་མམ། མངོན་པར་ཤེས་པ་དྲུག་གམ། སྟོབས་རྣམས་སམ། དབང་པོ་རྣམས་སམ། ཉན་ཐོས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའམ། ཉན་ཐོས་དབང་ཆེ་བར་གྲགས་པའམ། རང་བྱང་ཆུབ་མངོན་སུམ་དུ་བྱ་བར་འདོད་པ་དེས་ཀྱང་འདི་བཞིན་དུ་ལས་ཀྱི་སྒྲིབ་པ་རྣམས་སོ་སོར་བཤགས་པར་བྱའོ། །མི་བཅབ་པར་བྱའོ། །ཕྱིན་ཅད་ཀྱང་མི་བྱའོ། །
en: “Those who wish to have the three knowledges, or the six higher cognitions, or the strengths, or the powers, or the final goal of the śrāvakas, or fame as a very powerful śrāvaka, or to manifest the enlightenment of a pratyekabuddha, should in this way confess their individual karmic obscurations, not conceal them, and state that they will not repeat them.

source: སུ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་དང་། རྣམ་པར་དག་པའི་ཡེ་ཤེས་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་ཡེ་ཤེས་དང་། མཚུངས་པ་མེད་པའི་ཡེ་ཤེས་དང་། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་མངོན་པར་བསྒྲུབ་པར་འདོད་པ་དེས་ཀྱང་འདི་བཞིན་དུ་ལས་ཀྱི་སྒྲིབ་པ་རྣམས་སོ་སོར་བཤགས་པར་བྱའོ། །མི་བཅབ་པར་བྱའོ། །
en: “Those who wish to accomplish omniscient wisdom, completely pure wisdom, inconceivable wisdom, unequaled wisdom, and the wisdom of complete buddhahood should in this way confess their individual karmic obscurations, not conceal them, and state that they will not repeat them.

source: ཕྱིན་ཅད་ཀྱང་མི་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Why is that?

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའོ། །ཞེས་གསུངས་པའི་ཕྱིར་ཏེ།
en: Śāriputra, the Tathāgata has taught, ‘All phenomena originate through dependence.’

source: རྒྱུ་དང་རྐྱེན་གཞན་དང་། གཞན་གྱིས་གཞན་སྐྱེའོ་གཞན་འགོག་གོ། །
en: Because of certain causes and conditions, there is creation or cessation.

source: དེ་ལ་འདས་པའི་ཆོས་གང་ཡིན་པ་དེ་དག་ནི་འགགས་པ་ཟད་པ་དང་བྲལ་བ་རྣམ་པར་གྱུར་པ་སྟེ། དེ་དག་ལ་ཡང་ལས་ཀྱི་སྒྲིབ་པ་ཅུང་ཟད་ཀྱང་མེད་དོ། །
en: Those qualities that transcend this have no cessation or end, and they also do not have the slightest karmic obscuration.

source: དེ་ལྟར་ན་འདུ་བྱེད་གང་ཡིན་པ་རྣམས་ཀྱང་མེད་པ་ལས་བྱུང་བ་སྟེ། དེ་དག་ལ་ཡང་ལས་ཀྱི་སྒྲིབ་པ་ཅུང་ཟད་ཀྱང་མེད་དོ། །
en: They arise from the absence of anything that is composite.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་ནི་སྟོང་པ། སེམས་ཅན་མེད་པ། སྲོག་མེད་པ། གང་ཟག་མེད་པ། མ་སྐྱེས་པ།
en: Śāriputra, the Tathāgata has taught, ‘All phenomena are empty, have no being, have no soul, have no individuality, are unborn, are unceasing, and are noncomposite.’

source: མ་འགགས་པ། འདུས་མ་བྱས་པ། ཞེས་གསུངས་པའི་ཕྱིར་རོ། །ཤཱ་རིའི་བུ་ཆོས་ཐམས་ཅད་བདག་ལས་བྱུང་བ་ཡང་བདག་ཀྱང་ཡོད་པ་ཡིན་ནོ། །ཤཱ་རིའི་བུ་རིགས་ཀྱི་བུའམ།
en: “Śāriputra, all phenomena do not arise from self or have a self.

source: རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་འདི་ལྟ་སྟེ། སེམས་ཅན་མེད་པའི་མཐའི་ཆོས་ཀྱི་ཚུལ་འདི་ལ་འཇུག་པ་འདི་ནི། ལས་ཀྱི་སྒྲིབ་པའི་རྒྱུན་གཅོད་པ་ཞེས་བྱ་བ་སྟེ། ཤཱ་རིའི་བུ་འདི་ནི་སོ་སོར་བཤགས་པའོ། །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ལ།
en: Śāriputra, the engagement by a noble son or noble daughter in the nature of the ultimate Dharma of no being is called the end of the continuity of karmic obscuration, and that, Śāriputra, is the confession.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའམ། སེམས་ཅན་གཞན་དག་ཀྱང་རུང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འཚལ་བས། ཇི་ལྟར་དགེ་བའི་རྩ་བ་རྣམས་ལ་རྗེས་སུ་ཡི་རང་བར་བགྱི། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Venerable Śāriputra then asked the Bhagavat, “Bhagavat, how should a noble son or noble daughter who has entered the Śrāvakayāna, or has entered the Pratyeka­buddha­yāna, or has entered the Mahāyāna, or any other being who is seeking the highest, most complete enlightenment of buddhahood, rejoice in the roots of merit?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤཱ་རིའི་བུ་འདི་ལ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོས། ཉིན་ལན་གསུམ། མཚན་ལན་གསུམ་དུ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ལ། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། ཐལ་མོ་སྦྱར་ནས་ཚིག་འདི་སྐད་དུ། ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་སེམས་ཅན་གང་སུ་དག་སྦྱིན་པ་ལས་བྱུང་བའི་བསོད་ནམས་བགྱི་བའི་དངོས་པོ་དང་། ཚུལ་ཁྲིམས་ལས་བྱུང་བ་དང་། བསྒོམ་པ་ལས་བྱུང་བའི་བསོད་ནམས་བགྱི་བའི་དངོས་པོ་མངོན་པར་འདུས་བགྱིས་པ་དེ་དག་ཐམས་ཅད་ལ་ཡང་རྗེས་སུ་ཡི་རང་བའི་མཆོག་གིས་རྗེས་སུ་ཡི་རང་ངོ་། །
en: After Venerable Śāriputra had asked that, the Bhagavat said to him, “Śāriputra, a noble son or noble daughter who has entered the Śrāvakayāna, or has entered the Pratyeka­buddha­yāna, or has entered the Mahāyāna, or any other being who is seeking the highest, most complete enlightenment of buddhahood, should three times each day and three times each night, with the upper robe over one shoulder, kneel on the right knee, place their palms together in homage, and say these words: “ ‘I rejoice with the greatest joy in whatever merit has arisen from the generosity of beings in the ten directions, from their good conduct, and from the merit that has arisen from their meditation.

source: རྗེས་སུ་ཡི་རང་བ་དམ་པ་དང་། གཙོ་བོ་དང་། ཁྱད་པར་ཅན་དང་། རབ་དང་། ཕུལ་དང་། གྱ་ནོམ་པ་དང་། བླ་མ་དང་། བླ་ན་མེད་པ་དང་། ལྟག་ན་མེད་པ་དང་། མཉམ་པ་མེད་པ་དང་།
en: I rejoice in that merit with a joy that is sublime, preeminent, superior, complete, perfect, excellent, the highest, unsurpassable, superlative, unequaled, and that has no equal.

source: མི་མཉམ་པ་དང་། མཉམ་པས་རྗེས་སུ་ཡི་རང་ངོ་། །ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན། སེམས་ཅན་གང་སུ་དག་སྦྱིན་པ་ལས་བྱུང་བའི་བསོད་ནམས་བགྱི་བའི་དངོས་པོ་དང་། ཚུལ་ཁྲིམས་ལས་བྱུང་བ་དང་།
en: “ ‘I rejoice with the greatest joy in whatever merit is arising from the generosity of beings in the ten directions, from their good conduct, and from the merit that is arising from their meditation.

source: བསྒོམ་པ་ལས་བྱུང་བའི་བསོད་ནམས་བགྱི་བའི་དངོས་པོ་མངོན་པར་འདུ་བགྱིད་པར་འགྱུར་བ། དེ་དག་ཐམས་ཅད་ལ་ཡང་རྗེས་སུ་ཡི་རང་བའི་མཆོག་གིས་རྗེས་སུ་ཡི་རང་བ་ནས། རྗེས་སུ་ཡི་རང་བ་མི་མཉམ་པ་དང་། མཉམ་པའི་བར་གྱིས་རྗེས་སུ་ཡི་རང་ངོ་། །
en: I rejoice in that merit with a joy that is … and so on, until and that has no equal.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་སེམས་ཅན་གང་སུ་དག་སྦྱིན་པ་ལས་བྱུང་བའི་བསོད་ནམས་བགྱི་བའི་དངོས་པོ་དང་། ཚུལ་ཁྲིམས་ལས་བྱུང་བ་དང་། བསྒོམ་པ་ལས་བྱུང་བའི་བསོད་ནམས་བགྱི་བའི་དངོས་པོ་མངོན་པར་འདུ་བགྱིད་པ་དེ་དག་ཐམས་ཅད་ལ་ཡང་རྗེས་སུ་ཡི་རང་བའི་མཆོག་གིས་རྗེས་སུ་ཡི་རང་བ་ནས།
en: “ ‘I rejoice with the greatest joy in whatever merit will arise from the generosity of beings in the ten directions, from their good conduct, and from the merit that will arise from their meditation.

source: རྗེས་སུ་ཡི་རང་བ་མི་མཉམ་པ་དང་། མཉམ་པའི་བར་གྱིས་རྗེས་སུ་ཡི་རང་ངོ་། །བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ད་ལྟར་ན།
en: I rejoice in that merit with joy that is … and so on, until and that has no equal.

source: སེམས་དང་པོ་བསྐྱེད་པ་དེ་དག་གི་དང་པོ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དང་ལྡན་པའི་དགེ་བའི་རྩ་བ་གང་ལགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བསྐལ་པ་བརྒྱས་བྱུང་བ་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་གང་ལགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པ་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་གང་ལགས་པ་དང་། ཕྱིར་མི་ལྡོག་པ་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་གང་ལགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་ལ་ཡང་རྗེས་སུ་ཡི་རང་བའི་མཆོག་གིས་རྗེས་སུ་ཡི་རང་བ་ནས།
en: “ ‘I rejoice with the greatest joy in all the roots of merit possessed by those bodhisattvas who have first developed the enlightenment mind, in all the accumulations of merit of bodhisattvas that have been produced during a hundred eons, in all the accumulations of merit of bodhisattvas who have attained patience toward the birthlessness of phenomena, in all the accumulations of merit of those who have become irreversible, and in all the accumulations of merit of bodhisattvas who have one life remaining.

source: རྗེས་སུ་ཡི་རང་བ་མི་མཉམ་པ་དང་། མཉམ་པའི་བར་གྱིས་རྗེས་སུ་ཡི་རང་ངོ་། །
en: I rejoice in them with joy that is … and so on, until and that has no equal.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་ལྡན་པའི་དགེ་བའི་རྩ་བ་མངོན་པར་འདུས་བགྱིས་པ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་ལ་ཡང་རྗེས་སུ་ཡི་རང་བའི་མཆོག་གིས་རྗེས་སུ་ཡི་རང་ངོ་། །རྗེས་སུ་ཡི་རང་བ་དམ་པ་དང་། གཙོ་བོ་དང་། ཁྱད་པར་ཅན་དང་། རབ་དང་། ཕུལ་དང་། གྱ་ནོམ་པ་དང་། བླ་མ་དང་།
en: “ ‘I rejoice with the greatest joy in all the good roots from possessing the six perfections that were produced by the bodhisattva mahāsattvas during their past bodhisattva practice.

source: བླ་ན་མེད་པ་དང་། ལྟག་ན་མེད་པ་དང་། མཉམ་པ་མེད་པ་དང་། མི་མཉམ་པ་དང་། མཉམ་པས་རྗེས་སུ་ཡི་རང་ངོ་། །
en: I rejoice in them with a joy that is sublime, preeminent, superior, complete, perfect, excellent, the highest, unsurpassable, superlative, unequaled, and that has no equal.

source: མ་འོངས་པའི་དུས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱད་པ་སྤྱོད་པ་ན། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་ལྡན་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་མངོན་པར་འདུ་བགྱིད་པར་འགྱུར་བ་གང་ལགས་པ། དེ་དག་ཐམས་ཅད་ལ་ཡང་རྗེས་སུ་ཡི་རང་བའི་མཆོག་གིས་རྗེས་སུ་ཡི་རང་ངོ་། །རྗེས་སུ་ཡི་རང་བ་དམ་པ་དང་། གཙོ་བོ་དང་། ཁྱད་པར་ཅན་དང་། རབ་དང་། ཕུལ་དང་། གྱ་ནོམ་པ་དང་། བླ་མ་དང་།
en: “ ‘I rejoice with the greatest joy in all the accumulations of merit from possessing the six perfections that will be produced by the bodhisattva mahāsattvas in their bodhisattva practice in the future.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་ད་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་ན་དེ་དག་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་ལྡན་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་མངོན་པར་འདུ་བགྱིད་པ་གང་ལགས་པ་དེ་དག་ཐམས་ཅད་ལ་ཡང་རྗེས་སུ་ཡི་རང་བའི་མཆོག་གིས་རྗེས་སུ་ཡི་རང་ངོ་། །རྗེས་སུ་ཡི་རང་བ་དམ་པ་དང་། གཙོ་བོ་དང་། ཁྱད་པར་ཅན་དང་། རབ་དང་། ཕུལ་དང་། གྱ་ནོམ་པ་དང་། བླ་མ་དང་།
en: “ ‘I rejoice with the greatest joy in all the roots of merit from possessing the six perfections that are being produced by the bodhisattva mahāsattvas in their bodhisattva practice in the present.

source: བླ་ན་མེད་པ་དང་། ལྟག་ན་མེད་པ་དང་། མཉམ་པ་མེད་པ་དང་། མི་མཉམ་པ་དང་། མཉམ་པས་རྗེས་སུ་ཡི་རང་ངོ་། །སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་། མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་བདེ་བའི་སླད་དུ། སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གིས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྟན་པ། ཆོས་ཀྱི་ཚུལ་རབ་ཏུ་བཟུང་བ། ཆོས་ཀྱི་ཆར་རབ་ཏུ་ཕབ་པ། ཆོས་ཀྱི་ཆར་རབ་ཏུ་བཏང་བ། ཆོས་ཀྱི་རྔ་རབ་ཏུ་བརྡུངས་པ། ཆོས་ཀྱི་རྔ་བོ་ཆེ་བརྡུངས་པ། ཆོས་ཀྱི་དུང་བུས་པ། ཆོས་ཀྱི་སྲོག་ཤིང་བསྒྲེང་བ། ཆོས་ཀྱི་སྒྲོན་མ་འབར་བར་མཛད་པ།
en: I rejoice in them with a joy that is sublime, preeminent, superior, complete, perfect, excellent, the highest, unsurpassable, superlative, unequaled, and that has no equal.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་ཀྱི་སྦྱིན་པས་ཚིམ་པར་མཛད་པ་ཉམ་བག་ཏུ་སྤྱོད་དུ་འཛུད་པ་གང་ལགས་པ་དང་། དེ་ལ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའམ། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའམ། དེ་ལས་གཞན་པའི་སེམས་ཅན་རྣམས་ཀྱིས་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་གང་ལགས་པ།
en: “ ‘I rejoice with the greatest joy in the conscientious conduct of the tathāgata arhat samyaksaṃbuddhas of the past, who for the sake of benefit for many beings, for the happiness of many beings, out of compassion for the world, and for the welfare, benefit, and happiness of multitudes of beings, devas and humans, attained the highest, most complete enlightenment of buddhahood; turned the wheel of the Dharma; taught the wheel of the Dharma; possessed the way of the Dharma; gave the gift of the Dharma; lit the lamp of the Dharma; sent down the rain of the Dharma; beat the drum of the Dharma; beat the great drum of the Dharma; blew the conch of the Dharma; raised the central pillar of the Dharma; and brought satisfaction to all beings with the gift of the Dharma, through which roots of merit were generated by beings who entered the Śrāvakayāna, beings who entered the Pratyeka­buddha­yāna, beings who entered the Bodhisattvayāna, or any other beings.

source: དེ་དག་ཐམས་ཅད་ལ་ཡང་རྗེས་སུ་ཡི་རང་བའི་མཆོག་གིས་རྗེས་སུ་ཡི་རང་བ་ནས། རྗེས་སུ་ཡི་རང་བ་མི་མཉམ་པ་དང་། མཉམ་པའི་བར་གྱིས་རྗེས་སུ་ཡི་རང་ངོ་། །སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་།
en: I rejoice in them with a joy that is … and so on, until and that has no equal.

source: སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་། མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་། བདེ་བའི་སླད་དུ། མ་འོངས་པའི་དུས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས། དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་འགྱུར་བའི་བར་དག་གང་ལགས་པ་དང་། དེ་ལ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའམ། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའམ། དེ་ལས་གཞན་པའི་སེམས་ཅན་དེ་དག་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་འགྱུར་བ་གང་ལགས་པ།
en: “ ‘I rejoice with the greatest joy in the conscientious conduct of the tathāgata arhat samyaksaṃbuddhas of the future, who for the sake of benefit for many beings, for the happiness of many beings, out of compassion for the world, and for the welfare, benefit, and happiness of multitudes of beings, devas and humans, will attain the highest, most complete enlightenment of buddhahood; turn the wheel of the Dharma; teach the wheel of the Dharma; possess the way of the Dharma; give the gift of the Dharma; light the lamp of the Dharma; send down the rain of the Dharma; beat the drum of the Dharma; beat the great drum of the Dharma; blow the conch of the Dharma; raise the central pillar of the Dharma; and bring satisfaction to all beings with the gift of the Dharma, through which roots of merit will be generated by beings who have entered the Śrāvakayāna, beings who have entered the Pratyeka­buddha­yāna, beings who have entered the Bodhisattvayāna, or any other beings.

source: དེ་དག་ཐམས་ཅད་ལ་ཡང་རྗེས་སུ་ཡི་རང་བའི་མཆོག་གིས་རྗེས་སུ་ཡི་རང་བ་ནས། རྗེས་སུ་ཡི་རང་བ་མི་མཉམ་པ་དང་། མཉམ་པའི་བར་གྱིས་རྗེས་སུ་ཡི་རང་ངོ་། །སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་། མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་།
en: I rejoice in them with a joy that is … and so on, until and that has no equal.

source: བདེ་བའི་སླད་དུ། ད་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་སྟོན་པ། ཆོས་ཀྱི་ཚུལ་རབ་ཏུ་འཛིན་པ། ཆོས་ཀྱི་ཆར་རབ་ཏུ་འབེབས་པ། ཆོས་ཀྱི་ཆར་རབ་ཏུ་གཏོང་བ། ཆོས་ཀྱི་སྦྱིན་པ་མཛད་པ། ཆོས་ཀྱི་སྒྲོན་མ་འབར་བར་མཛད་པ། ཆོས་ཀྱི་རྔ་བརྡུང་བ། ཆོས་ཀྱི་རྔ་བོ་ཆེ་བརྡུང་བ། ཆོས་ཀྱི་དུང་འབུད་པ། ཆོས་ཀྱི་སྲོག་ཤིང་སྒྲེང་བ། སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་ཀྱི་སྦྱིན་པས་ཚིམ་པར་མཛད་པ། ཉམ་བག་ཏུ་སྤྱོད་དུ་འཛུད་པ་གང་ལགས་པ་དང་། དེ་ལ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའམ། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའམ། དེ་ལས་གཞན་པའི་སེམས་ཅན་དེ་དག་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་གང་ལགས་པ།
en: “ ‘I rejoice with the greatest joy in the conscientious conduct of the tathāgata arhat samyaksaṃbuddhas of the present time in the worlds of the ten directions who, for the sake of benefit for many beings, for the happiness of many beings, out of compassion for the world, and for the welfare, benefit, and happiness of multitudes of beings, devas and humans, have attained the highest, most complete enlightenment of buddhahood; turn the wheel of the Dharma; teach the wheel of the Dharma; possess the way of the Dharma; give the gift of the Dharma; light the lamp of the Dharma; send down the rain of the Dharma; beat the drum of the Dharma; beat the great drum of the Dharma; blow the conch of the Dharma; raise the central pillar of the Dharma; and bring satisfaction to all beings with the gift of the Dharma, through which the roots of merit are generated by beings who have entered the Śrāvakayāna, beings who have entered the Pratyeka­buddha­yāna, beings who have entered the Bodhisattvayāna or any other beings.

source: དེ་དག་ཐམས་ཅད་ལ་ཡང་རྗེས་སུ་ཡི་རང་བའི་མཆོག་གིས་རྗེས་སུ་ཡི་རང་བ་ནས། རྗེས་སུ་ཡི་རང་བ་མི་མཉམ་པ་དང་། མཉམ་པའི་བར་གྱིས་རྗེས་སུ་ཡི་རང་ངོ་ཞེས་བརྗོད་པར་བྱའོ། །
en: I rejoice in them with a joy that is … and so on, until and that has no equal.’

source: ཤཱ་རིའི་བུ་འདི་ནི་རྗེས་སུ་ཡི་རང་བའི་བསོད་ནམས་ཀྱི་ཕུང་པོའོ། །
en: “Śāriputra, this is rejoicing’s aggregation of merit.

source: རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་རྗེས་སུ་ཡི་རང་བའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་འདིས་རྗེས་སུ་ཡི་རང་ན། བསོད་ནམས་ཀྱི་ཕུང་པོ་མང་པོ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་སྐྱེད་དོ། །
en: If a noble son or noble daughter rejoices with this merit from rejoicing, they will generate many incalculable, measureless aggregations of merit.

source: ཤཱ་རིའི་བུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ནས། འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པར་གྱུར་ལ། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས་དེ་དག་ལ་ཇི་སྲིད་འཚོའི་བར་དུ། གོས་དང་། ཟས་དང་། ན་བའི་གསོས་སྨན་དང་།
en: “Śāriputra, if the beings in not only this trichiliocosm world realm, but in as many world realms as there are grains of sand in the Ganges River, were all arhats whose defilements had ceased, and if a noble son or noble daughter were to serve them for as long as they lived, with clothing, food, medicines when ill, and other requisites, even then someone who rejoices through this rejoicing would create immeasurably, incalculably greater merit.

source: ཡོ་བྱད་རྣམས་ཀྱིས་བསྙེན་བཀུར་བྱས་པ་བས། གང་ཞིག་རྗེས་སུ་ཡི་རང་བ་འདིས་རྗེས་སུ་ཡི་རང་ན། དེ་ནི་དེ་བས་བསོད་ནམས་ཆེས་མང་དུ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་སྐྱེད་དོ། །ཤཱ་རིའི་བུ་དེ་ལྟ་བས་ན་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས།
en: “Therefore, Śāriputra, a noble son or noble daughter who wishes for the highest, most complete enlightenment of buddhahood should rejoice with this kind of rejoicing.

source: རྗེས་སུ་ཡི་རང་བ་འདིས་རྗེས་སུ་ཡི་རང་བར་བྱའོ། །བུད་མེད་སྐྱེས་པའི་ལུས་ཀྱི་དབང་པོ་ཐོབ་པར་འདོད་ཅིང་། བུད་མེད་ཀྱི་དབང་པོ་བརྗེ་བར་འདོད་པས་ཀྱང་རྗེས་སུ་ཡི་རང་བ་འདིས་རྗེས་སུ་ཡི་རང་བར་བྱའོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: A woman who wishes to attain a male’s organs, who wishes to exchange her female organs for them, should rejoice with this kind of rejoicing.”

source: བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་མ་འོངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་སྣང་བ་བགྱིས་པར་འགྱུར་བ་དང་། ད་ལྟར་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་མོས་པ་སྐྱེད་པར་འགྱུར་བའི་བསྐུལ་བའི་ཕུང་པོ་ཡང་བཤད་དུ་གསོལ། དེ་སྐད་ཅེས་གསོལ་བ་དང་།
en: When the Bhagavat had said that, Venerable Śāriputra replied to him, “Bhagavat, I pray that you teach the accumulation of supplications that illuminates the bodhisattva mahāsattvas of the future and gives rise to aspiration in the bodhisattvas of the present.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤཱ་རིའི་བུ་འདི་ལ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའམ། སེམས་ཅན་གཞན་དག་ཀྱང་རུང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས། ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་དུ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ལ། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། ཐལ་མོ་སྦྱར་ནས་ཚིག་འདི་སྐད་དུ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་ད་ལྟ་ན། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་དག་ལ་ཕྱག་འཚལ་ལོ། །
en: When Venerable Śāriputra had said that, the Bhagavat replied to him, “Śāriputra, a noble son or noble daughter who has entered the Śrāvakayāna, or has entered the Pratyeka­buddha­yāna, or has entered the Mahāyāna, or any other being who wishes for the highest, most complete enlightenment of buddhahood, should three times each day and three times each night, with the upper robe over one shoulder, kneel on the right knee, place their palms together in homage, and say these words: “ ‘I pay homage to the buddha bhagavats, who in this present time in the worlds of the ten directions have attained the highest, most complete enlightenment of buddhahood.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་ཕྱག་འཚལ་ནས། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བར་བསྐུལ་གྱིས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། སྨན་པ་དང་བདེ་བའི་སླད་དུ།
en: “ ‘Through my paying homage to those buddha bhagavats, and requesting them to turn the wheel of the Dharma, I pray that those buddha bhagavats, for the sake of benefit for many beings, for the happiness of many beings, out of compassion for the world, and for the welfare, benefit, and happiness of multitudes of beings, devas, and humans, turn the wheel of the Dharma.

source: ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་དུ་གསོལ། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྟན་དུ་གསོལ།
en: I pray that they teach the wheel of the Dharma.

source: ཆོས་ཀྱི་ཚུལ་རབ་ཏུ་གཟུང་དུ་གསོལ།
en: I pray that they possess the way of the Dharma.

source: ཆོས་ཀྱི་སྦྱིན་པ་མཛད་དུ་གསོལ།
en: I pray that they give the gift of the Dharma.

source: ཆོས་ཀྱི་སྒྲོན་མ་འབར་བར་མཛད་དུ་གསོལ།
en: I pray that they light the lamp of the Dharma.

source: ཆོས་ཀྱི་ཆར་དབབ་ཏུ་གསོལ།
en: I pray that they send down the rain of the Dharma.

source: ཆོས་ཀྱི་ཆར་གཏང་དུ་གསོལ།
en: I pray that they let fall the rain of the Dharma.

source: ཆོས་ཀྱི་རྔ་བརྡུང་དུ་གསོལ།
en: I pray that they beat the drum of the Dharma.

source: ཆོས་ཀྱི་རྔ་བོ་ཆེ་བརྡུང་དུ་གསོལ།
en: I pray that they beat the great drum of the Dharma.

source: ཆོས་ཀྱི་དུང་འབུད་དུ་གསོལ།
en: I pray that they blow the conch of the Dharma.

source: ཆོས་ཀྱི་སྲོག་ཤིང་བསྒྲེང་དུ་གསོལ་ཞེས་བརྗོད་པར་བྱའོ། །ཤཱ་རིའི་བུ་གཞན་ཡང་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པའམ། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའམ། སེམས་ཅན་གཞན་དག་ཀྱང་རུང་སྟེ། ཉིན་ལན་གསུམ།
en: I pray that they raise the central pillar of the Dharma.’
